data/perf/campaign-f3deebfbab60/primary/memcached/tsan-st/run4/memtier.txt
10        Threads
50        Connections per thread
100000    Requests per client


BEST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       146734.40          ---          ---         5.11781         5.11900        11.19900        13.95100     10014.58 
Gets      1467327.83      1178.27   1466149.56         4.99743         4.99100        11.00700        13.75900     37166.53 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1614062.23      1178.27   1466149.56         5.00838         4.99100        11.00700        13.82300     47181.10 


WORST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       145566.78          ---          ---         5.17991         5.24700        11.26300        14.01500      9934.89 
Gets      1455651.83      1168.89   1454482.94         5.05701         5.08700        11.07100        13.82300     36870.78 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1601218.62      1168.89   1454482.94         5.06818         5.08700        11.07100        13.88700     46805.67 


AGGREGATED AVERAGE RESULTS (5 runs)
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       146231.62          ---          ---         5.19209         5.24700        11.26300        14.01500      9980.26 
Gets      1462300.07      1070.50   1461229.57         5.06898         5.08700        11.00700        13.82300     37032.91 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1608531.68      1070.50   1461229.57         5.08018         5.11900        11.07100        13.82300     47013.17